<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6b0c7cedc0d4ca5e4e7f67f9084c79dc8490c0b443ddc3895b1e83adc8401c02","plan_job_ref":"Job Terraform Plan #45 at https://github.com/cal-itp/cal-bc/actions/runs/18700722700","plan_out_hash":"8854369828b651caa6bdddd89c497d98a3110442fe47b02949bb9c3c17145e7a","plan_hash":"b1dbc5ca77a53ec4fddfaf8f54abb668753330842a015438b448a3badf0c89af","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_secret_manager_secret_version.cal-bc-staging-cloudrun-service-urls must be replaced
-/+ resource "google_secret_manager_secret_version" "cal-bc-staging-cloudrun-service-urls" {
!~      create_time            = "2025-10-21T23:33:34.097812Z" -> (known after apply)
+       destroy_time           = (known after apply)
!~      id                     = "*****************************************************************************" -> (known after apply)
!~      name                   = "projects/473674835135/secrets/cal-bc-staging-cloudrun-service-urls/versions/5" -> (known after apply)
+       secret_data            = (sensitive value) # forces replacement
!~      version                = "5" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Available Write-only Attribute Alternative

  with google_secret_manager_secret_version.cal-bc-staging-cloudrun-service-urls,
  on secrets.tf line 91, in resource "google_secret_manager_secret_version" "cal-bc-staging-cloudrun-service-urls":
  91:   secret_data = join(",", concat(google_cloud_run_v2_service.cal-bc-staging.urls, ["https://${local.domain}"]))

The attribute secret_data has a write-only alternative secret_data_wo
available. Use the write-only alternative of the attribute when possible.
```
</details>

:memo: Plan generated in [Terraform Plan #45](https://github.com/cal-itp/cal-bc/actions/runs/18700722700)